Revit 2027 API
ViewSheet.ConvertToRealSheet Method
 Converts a placeholder sheet to a real one with an optional titleblock.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void ConvertToRealSheet(
	ElementId titleBlockTypeId
)
Public Sub ConvertToRealSheet (
	titleBlockTypeId As ElementId
)
public:
void ConvertToRealSheet(
	ElementId^ titleBlockTypeId
)
member ConvertToRealSheet :
        titleBlockTypeId : ElementId -> unit
Parameters
titleBlockTypeId ElementId
 The id of the placeholder sheet, or invalidElementId if no titleblock should be added.
Exceptions
Exception | Condition
ArgumentException |  titleBlockTypeId does not correspond to a TitleBlock type.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  This method may only be called on a placeholder sheet. -or- Failed to convert the sheet because the input titleblock could not be applied.
See Also
Reference
ViewSheet Class
Autodesk.Revit.DB Namespace